src/main/resources/request_templates/SetAppointment.mustache

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:a="http://www.w3.org/2005/08/addressing"
               xmlns:ser="http://www.qnomy.com/Services">
    <soap:Header>
        <a:Action>http://www.qnomy.com/Services/IsvcService/SetAppointment</a:Action>
        <a:MessageID>urn:uuid:{{messageUUID}}</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:To>
            {{serviceAddress}}
        </a:To>
    </soap:Header>
    <soap:Body>
        <ser:SetAppointment>
            <ser:apiSessionId>{{apiSessionId}}</ser:apiSessionId>
            <ser:serviceId>{{serviceId}}</ser:serviceId>
            <ser:parentCaseId>0</ser:parentCaseId>
            <ser:dateAndTime>{{dateAndTime}}</ser:dateAndTime>
            <ser:customerId>{{customerId}}</ser:customerId>
            <ser:appointmentTypeId>{{appointmentTypeId}}</ser:appointmentTypeId>
            <ser:subject>Citizenship Appointment for {{clientId}}</ser:subject>
            <ser:notes>Appointment generated by Online Scheduling System</ser:notes>
            <ser:preventAutoQueue>false</ser:preventAutoQueue>
            <ser:languageCode>en</ser:languageCode>
            <ser:isWalkIn>false</ser:isWalkIn>
            <ser:forceSimultaneousAppointment>true</ser:forceSimultaneousAppointment>
            <ser:forceWastedDuration>true</ser:forceWastedDuration>
            <ser:autoFreeUp>true</ser:autoFreeUp>
        </ser:SetAppointment>
    </soap:Body>
</soap:Envelope>
